from пицца import ПиццаПепперони, ПиццаБарбекю, ПиццаДарыМоря
from заказ import Заказ
from терминал import Терминал


class ТестовыйСценарий:


    @staticmethod
    def тестирование_приложения():

        # Тест 1: Создание заказа и добавление пиццы
        терминал = Терминал()
        терминал.показать_меню()
        терминал.обработать_команду(1)  # Добавление ПиццаПепперони
        assert len(терминал.заказ.заказанные_пиццы) == 1, "Ошибка в тесте 1"

        # Тест 2: Отмена заказа
        терминал.обработать_команду(Терминал.КОМАНДА_ОТМЕНА_ЗАКАЗА)
        assert терминал.заказ is None, "Ошибка в тесте 2"

        # Тест 3: Создание заказа, добавление нескольких пицц и подтверждение заказа
        терминал.показать_меню()
        терминал.обработать_команду(1)  # Добавление ПиццаПепперони
        терминал.обработать_команду(2)  # Добавление ПиццаБарбекю
        терминал.обработать_команду(Терминал.КОМАНДА_ПОДТВЕРЖДЕНИЕ_ЗАКАЗА)
        assert терминал.заказ is not None and len(терминал.заказ.заказанные_пиццы) == 2, "Ошибка в тесте 3"

        # Тест 4: Расчет сдачи
        терминал.принять_оплату()  # Пользователь вводит сумму, эмулируя оплату
        # В данном случае, проверим, что не возникает исключений при оплате

        print("Все тесты успешно выполнены!")




